{"id":1351,"idMal":1351,"title":{"romaji":"Angel Cop","english":"Angel Cop","native":"エンジェルコップ"},"type":"ANIME","format":"OVA","status":"FINISHED","description":"Sometime in the future, terrorism in Japan has become commonplace, and the police have become almost as brutal as criminals. One cop, known as Angel, is the best of the best, stopping at nothing in her fight for justice. Things get interesting for Angel Cop and her new partner when they begin investigating a series of murders in which the victims are other criminals, killed in very unpleasant ways. These criminals, a group of psychics that banded together to hunt down the lowest scum in the city, and bring them to justice. After a couple of encounters between the cops and the psychics, two of the psychics begin to think that maybe they're not the good guys after all, but the third prefers killing to morality. Augmented by cybernetics from a mysterious source, he heads out on a killing spree, with Angel as his first target. Even with help from the other two psychics and her newly cyborged partner (after an unfortunate accident), Angel is going to have her work cut out trying to find the rogue psychic and the organization behind him. ","startDate":{"year":1989,"month":9,"day":1},"endDate":{"year":1994,"month":5,"day":20},"season":"FALL","seasonYear":1989,"episodes":6,"duration":30,"chapters":null,"volumes":null,"countryOfOrigin":"JP","source":"ORIGINAL","coverImage":{"extraLarge":"https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx1351-jSbFKT36hmv6.jpg","large":"https://s4.anilist.co/file/anilistcdn/media/anime/cover/medium/bx1351-jSbFKT36hmv6.jpg","medium":"https://s4.anilist.co/file/anilistcdn/media/anime/cover/small/bx1351-jSbFKT36hmv6.jpg"},"bannerImage":"https://s4.anilist.co/file/anilistcdn/media/anime/banner/1351-RbjaIGG4BXOj.jpg","genres":["Action","Adventure","Sci-Fi"],"averageScore":55,"popularity":8110,"relations":{"edges":[{"relationType":"ADAPTATION","node":{"id":72645,"title":{"romaji":"Angel Cop"},"type":"MANGA"}}]}}
